# Даны координаты двух различных полей шахматной доски (числа 1-8). Проверить истинность высказывания: «Ладья за один ход может перейти с одного поля на другое».
print('x это номер вертикали (столбца), y это номер горизонтали (строки).')
try:
    x1 = int(input("Введите x1 (1-8): "))
    y1 = int(input("Введите y1 (1-8): "))
    x2 = int(input("Введите x2 (1-8): "))
    y2 = int(input("Введите y2 (1-8): "))
    if min(x1, y1, x2, y2) < 1 or max(x1, y1, x2, y2) > 8:
        print("Координаты должны быть от 1 до 8!")
    elif x1 == x2 and y1 == y2:
        print("Поля должны быть различными!")
    else:
        print(x1 == x2 or y1 == y2)
except ValueError:
    print("Неправильно ввели! Нужны целые числа.")